Revit 2026 API

# PointCloudColorSettings(Color, Color) Constructor

---

Constructs color settings object from given colors.

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointCloudColorSettings(
	Color color1,
	Color color2
)
```
```vb
Public Sub New (
	color1 As Color,
	color2 As Color
)
```
```cpp
public:
PointCloudColorSettings(
	Color^ color1,
	Color^ color2
)
```
```fsharp
new :
        color1 : Color *
        color2 : Color -> PointCloudColorSettings
```

#### Parameters

color1 Color

color2 Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PointCloudColorSettings Class

PointCloudColorSettings Overload

Autodesk.Revit.DB.PointClouds Namespace